/*----------------------------------------
**	3.输入一个字符串，内有数字和非数字字符，
**	例如：
**		a123x456 17960?302tab5876
**	将其中连续的数字作为一个整数，依次存放在
**	数组a中，例如123存放在a[0],456存放在a[1],
**	统计其中有多少个整数，并输出这些数
**----------------------------------------
*/

#include <stdio.h>

int fun(int a[],char b[])
{
	int i, j, k, n = 0;
	for (i = 0; b[i] != '\0'; i++)
	{
		if (b[i]>='0' && b[i] <= '9')
		{
			for (j = i; b[j]>='0' && b[j] <='9'; j++)
			{
				b[j] = b[j] - '0';
			}
			for (a[n] = 0,k = i; k < j; k++)
			{
				a[n] *= 10;
				a[n] += b[k];
			}
			n++;
			i = j;
		}
	}
	return n;
}

void main()
{
	int i, n, a[20];
	char b[20];
	fgets(b,20,stdin);
	n = fun(a,b);
	for (i = 0; i < n; i++)
	{
		printf("%5d\n",a[i]);
	}	
	printf("\nnum = %d\n",n);
}
