/*----------------------------------------
**	5.张山说李四在说谎，李四说王五在说谎，
**	王五说李四和张三都在说谎，现在问这三个人
**	中谁说的是真话，谁说的是假话？
**----------------------------------------
*/

#include <stdio.h>
void main()
{
	int a1 = 1,b1 = 1,c1 = 1, a, b, c;
	if (a1)
	{
		a = a1;
		c = !a&&!b;
		b = !c;
		a = !b;
		if (a == a1)
		printf("a = %d, b = %d, c = %d\n",a,b,c);
	}
	if (b1)
	{
		b = b1;
		a = !b;
		c = !a&&!b;
		b = !c;
		if (b == b1)
		{
			printf("a = %d, b = %d, c = %d\n",a,b,c);
		}
	}
	if (c1)
	{
		c = c1;
		b = !c;
		a = !b;
		c = !a&&!b;
		if (c == c1)
		{
			printf("a = %d, b = %d, c = %d\n",a,b,c);
		}
	}
	
}
