/*----------------------------------------
**	3.有一个数组a[100],要求写一个函数将
**	a中的0都移至数组末尾，将非0移至开始
**	（保持原来的顺序不变）例如:
**	a原来是：1,0,3,4,0,6,5
**	经过函数处理后变成1,3,4,6,5,0,0
**----------------------------------------
*/

#include <stdio.h>
#define n 7
void main()
{
//	int n;
//	scanf("%d",&n);
	int a[n] = {1,0,3,4,0,6,5};
	int i, j, k = 0, *p = a;
//	for (i = 0; i < n; i++)
//	{
//		scanf("%d",*(p+i));
//	}
	for (i = 0; i < n - k; i++)
	{
		if (*(p+i) == 0)
		{
			for (j = i; j < n - 1; j++)
			{
				*(p + j) = *(p + j + 1);
			}
			*(p + j) = 0;
			i--;
			k++;
		}
	}
	for (i = 0; i < n; i++)
	{
		printf("%4d",*(p+i));
	}
	printf("\n");
}
