/*----------------------------------------
**	5.打印任意阶数螺旋矩阵，五阶示例如下：
**	1    2    3    4    5
**
**	16   17  18   19    6
**
**	15   24  25   20    7
**
**	14   23  22   21    8
**
**	13   12  11   10    9
**----------------------------------------
*/

#include <stdio.h>

void main()
{
	int i, j, k, m = 1, n;
	printf("n = ");
	scanf("%d",&n);
	int a[n][n];
	for (k = 0; k <= n/2; k++)
	{
		for (i = k, j = k; j < n - k; j++)
		{
			a[i][j] = m++;
		}
		for (i++,j--; i < n - k; i++)
		{
			a[i][j] = m++;
		}
		for (i--,j--; j >= k; j--)
		{
			a[i][j] = m++;
		}
		for (i--,j++; i > k; i--)
		{
			a[i][j] = m++;
		}
	}
	
	for (i = 0; i < n; i++)
	{
		for (j = 0; j < n; j++)
		{
			printf("%4d",a[i][j]);
		}
		printf("\n");
		printf("\n");
	}
}
