/*----------------------------------------
**	输出下图所示的图案。
         *
      *  *  *
   *  *  *  *  *
*  *  *  *  *  *  *
   *  *  *  *  *
      *  *  *
         *
**----------------------------------------
*/

#include <stdio.h>
void main()
{
	int i,j,k;
	for(i = 1;i <= 4;i++)	
		{
			for(j=4-i;j>0;j--)
				{
					printf(" ");
				}
			for(k = 2*i-1;k > 0;k--)
				{
					printf("*");
				}
		printf("\n");
		}
	for(i = 3;i > 0;i--)
		{
			for(j=4-i;j>0;j--)
				{
					printf(" ");
				}
			for(k = 2*i-1;k > 0;k--)
				{
					printf("*");
				}
		printf("\n");
		}
}
