/*----------------------------------------
**	 设置一个小的加密与解密程序，要求如下：
**	 1．定义一个数组并通过循环对其输入赋值；
**	2．自定义密码对数组内容加密，即若想显示数
**	组内容则需输入相应密码；
**	3．密码正确则输出数组内容，错误则提示重新输入。
**----------------------------------------
*/

#include <stdio.h>
void main()
{
	int i,j,k,m;
	printf("请输入行数（奇数）:\n");
	scanf("%d",&m);
	for(i = 1;i <= m/2+1;i++)	
		{
			for(j=m/2+1-i;j>0;j--)
				{
					printf(" ");
				}
			for(k = 2*i-1;k > 0;k--)
				{
					printf("*");
				}
		printf("\n");
		}
	for(i = m-m/2-1;i > 0;i--)
		{
			for(j=m-m/2-i;j>0;j--)
				{
					printf(" ");
				}
			for(k = 2*i-1;k > 0;k--)
				{
					printf("*");
				}
		printf("\n");
		}
}
