/*----------------------------------------
**	 1、 用原来的字母后面第4个字母代替原来的字符
**	并将大写字母变成小写字母，小写字母变成
**	大写字母。
**	 “China”应译为“gLMRE”
**	编写一个菜单。
**----------------------------------------
1、 加密
2、 解密
3、 退出
   分别实现加密，解密功能（最好用自定义函数实现，注
   意模块化编程思想）
**----------------------------------------
*/

#include <stdio.h>
void jiami(char *p)
{
	for(;*p!='\0';p++)
	{
		*p=*p+4;
		if((*p>'Z'&&*p<'a')||*p>'z')
		{
			*p-=26;
		}
		if(*p>='A'&&*p<='Z')
		{
			*p+=32;
		}
		else 
		{
			*p-=32;
		}
	}
}
void jiemi(char *p)
{
	for(;*p!='\0';p++)
	{
		if(*p>='A'&&*p<='Z')
		{
			*p+=32;
		}
		else 
		{
			*p-=32;
		}
		*p=*p-4;
		if (*p>'z'||(*p<'a'&&*p>'Z'))
		{
			*p-=26;
		}
		else if (*p < 'A')
		{
			*p+=26;
		}
	}
}
void main()
{
	int i;
	char str[50];
	while (1)
	{
		printf("************************\n");
		printf("1.加密!\n");
		printf("2.解密!\n");
		printf("3.退出!\n");
		printf("************************\n");
		scanf("%d",&i);
		if (i==1)
		{
			printf("请输入要加密的内容!\n");
			scanf("%s",str);
			jiami(str);
			printf("加密为:%s!\n",str);
		}
		if (i==2)
		{
			jiemi(str);
			printf("加密的内容为:%s\n",str);
		}
		if (i==3)
		{
			break;
		}
	}
}
