/*----------------------------------------
**	 在歌星大奖赛中，有10个评委为参赛的选手
**	 打分，分数为1到100分。选手最后得分为：
**	去掉一个最高分和一个最低分其余取剩下8个分
**	数的平均值。请编写一个程序实现。
**----------------------------------------
*/

#include <stdio.h>
void main()
{
	int i,max=0,min=0,A[10],sum=0;
	for(i = 0;i<10;i++)
		scanf("%d",&A[i]);
	for(i=0;i<10;i++)
	{
		if(A[0]>A[i])
		{
			min=A[i];
			A[i]=A[0];
			A[0]=min;
		}
		
	}
	printf("%d\n",A[0]);
	for(i=0;i<10;i++)
	{
		if(A[9]<A[i])
		max=A[i];
		A[i]=A[9];
		A[9]=max;
	}
	printf("%d\n",A[9]);
	for(i=1;i<9;i++)
	{
		sum+=A[i];
	}
	printf("The average is %f\n",sum/8.0);
}
