/*----------------------------------------
**	1. 栈在表达式计算过程中的应用：建立操作数
**	栈和运算符栈。运算符有优先级。规则：
**	1. 自左至右扫描表达式，凡是遇到操作数一律
**	进操作数栈。当遇到运算符时，如果它的优先级
**	比运算符栈栈顶元素的优先级高就进栈。反之，
**	取出栈顶运算符和操作数栈栈顶的连续两个操作
**	数进行运算，并将结果存入操作数栈，然后继续
**	比较该运算符与栈顶运算符的优先级。当遇到括
**	号时，左括号一律进运算符栈，右括号一律不进
**	运算符栈。一旦遇到右括号，就取出运算符栈顶
**	运算符和操作数栈顶的两个操作数进行运算，并
**	将结果压入操作数栈，直到取出左括号为止。
**	(提示：要用到两个栈)。
**----------------------------------------
*/

#include <stdio.h>
#include <malloc.h>
#include "caozuo.h"
#include "yunsuan.h"



void main()
{
	stack *caozuo, *yunsuan;
	initstacky(&caozuo);
	initstackc(&yunsuan);
	char a[100] = "1+2+3";
	for (i = 0; a[i] != '\0'; i++)
	{
		if (a[i]>= '0' && a[i] <= '9')
		{
			pushy(&yunsuan,a[i]);
		}
		else
		{
			pushc(&caozuo,a[i]);
		}
	}
}
