/*----------------------------------------
**	 输出“魔方阵”。所谓魔方阵是指这样的方阵，
**	它的每一行，每一列和对角线之和均相等。
**	例如，三阶魔方阵为(阶数只可能为奇数)
**  8	1	6
**	3	5	7
**	4	9	2
**----------------------------------------
*/

#include <stdio.h>
void main()
{
	int i, j, k, m = 1, n, l;
	printf("input n = ");
	scanf("%d",&n);
	int a[n][n];
	j = n/2;
	l = 0;
	for (i = 1; i <= n; i++)
	{
		for (k = 1; k <= n; k++)
		{
			if (l < 0)
			{
				l = l+n;
			}
			if (j >=n)
			{
				j = j-n;
			}
			a[l][j] = m;
			m++;
			if (k == n)
			{
				l++;
				break;
			}
			j++;
			l--;
		}
	}
	for (i = 0; i < n; i++)
	{
		for (j = 0; j < n; j++)
		{
			printf("%4d",a[i][j]);
		}
		printf("\n");
	}
}
