/*----------------------------------------
**	2. 甲乙丙丁四个人开始放鞭炮，甲每隔7秒放一次，
**	乙每隔5秒放一次，丙每隔6秒放一次，丁每隔4秒放
**	一次，每人各放10次，求出总共听到鞭炮多少次
**----------------------------------------
*/

#include <stdio.h>
void main()
{
	int i, k = 37;
	for (i = 1; i < 64; i++)
	{
		if (i % 7 == 0 && i % 5 == 0 && i / 5 < 10)
		{
			k--;
			printf("111%d\n",i);
		}
		if (i % 7 == 0 && i % 6 == 0 && i / 6 < 10)
		{
			k--;
			printf("222%d\n",i);
		}
		if (i % 7 == 0 && i % 4 == 0 && i / 4 < 10)
		{
			k--;
			printf("333%d\n",i);
		}
		if (i % 5 == 0 && i % 6 == 0 && i / 5 < 10)
		{
			k--;
			printf("444%d\n",i);
		}
		if (i % 5 == 0 && i % 4 == 0 && i / 4 < 10)
		{
			k--;
			printf("555%d\n",i);
		}
		if (i % 6 == 0 && i % 4 == 0 && i / 4 < 10)
		{
			k--;
			printf("666%d\n",i);
		}
	}
	printf("%d",k);
}
