/*----------------------------------------
**	3. 十个小孩围成一圈分糖果，老师分给第一个小
**	孩10块第二个小孩2块，第三个小孩8块，第四个
**	小孩22块，第五个小孩16块，第六个小孩4块，
**	第七个小孩10块，第八个小孩6块，第九个小孩14块
**	第十个小孩20块，同时将自己手中的糖分一半给
**	右边的小孩,糖块数为奇数的人可以向老师要一块,
**	问经过这样几次调整后大家手中的糖的块数一样多,
**	有多少块糖
**----------------------------------------
*/

#include <stdio.h>

void change(int a[])
{
	int i, j;
	for (i = 0; i < 10; i++)
	{
		a[i] = a[i]/2;
	}
	j = a[9];
	for (i = 9; i > 0; i--)
	{
		a[i] = a[i] + a[i-1];
	}
	a[0] = a[0] + j;
	for (i = 0; i < 10; i++)
	{
		if (a[i]%2 != 0)
		{
			a[i] = a[i] + 1;
		}
	}
}

void main()
{
	int i, j, k = 0, a[10]={10,2,8,22,16,4,10,6,14,20};
	while (1)
	{
		k++;
		change(a);
		for (i = 1, j = 0; i < 10; i++)
		{
			if (a[0] == a[i])
			{
				j++;
			}
		}
		if (j == 9)
		{
			break;
		}
	}
	
	for (i = 0; i < 10; i++)
	{
		printf("%3d ",a[i]);
	}
	printf("\n");
	printf("num = %d\n",k);
}
